Repository: ECCC-MSC/libecbufr
Catalog: po/*.po
Languages: fr_ca, pt_br

source: Warning: current implementation does not support >64 AF bits (%d)
fr_ca: Attention : l'implémentation courante ne supporte pas plus de 64 bits pour les champs associés(AF) (%d)
pt_br: Atenção: Tamanho do array inicial muito pequeno: %d

source: Error in bufr_duplicate_af(): cannot copy NULL in bufr_duplicate_af
fr_ca: Erreur avec la fonction « bufr_duplicate_af » : impossible de copier la valeur nulle
pt_br: Erro em bufr_duplicate_af(): impossível copiar NULL em bufr_duplicate_af

source: Error in bufr_create_afd(): %d AF bit > 64
fr_ca: Erreur avec la fonction « bufr_create_afd() » : %d bit AF(champs associés) > 64
pt_br: Erro em bufr_create_afd(): %d AF bit > 64

source: Error: cannot copy NULL in bufr_duplicate_af
fr_ca: Erreur : impossible de copier la valeur nulle dans la fonction « bufr_duplicate_af »
pt_br: Erro: impossível copiar NULL em bufr_duplicate_af

source: Warning: cannot copy different AF
fr_ca: Attention : impossible de copier des champs associés(AF) différents
pt_br: Atenção: impossível copiar diferente AF

source: Warning: cannot copy different AF: dest=%d != src=%d
fr_ca: Attention : impossible de copier des champs associés(AF) différents : destination=%d != source=%d
pt_br: Atenção: impossível copiar diferente AF: dest=%d != src=%d

source: ### Debugging printout of BUFR API Version: %s
fr_ca: ### Information de débogage de la version: %s de l'API BUFR
pt_br: ### Depurando impressão de BUFR API Version: %s

source: Warning: initial array size too small: %d
fr_ca: Attention : taille initiale du tableau trop petite: %d
pt_br: Atenção: Tamanho do array inicial muito pequeno: %d

source: Warning: item can't be added
fr_ca: Attention : l'item n'a pu être ajouté
pt_br: Atenção: item não pode ser adicionado

source: error arr_allocate no more memory: %d
fr_ca: erreur avec la fonction « arr_allocate »; plus de mémoire : %d
pt_br: erro arr_allocate memoria insuficiente: %d

source: error arr_create no more memory
fr_ca: erreur avec la fonction « arr_create »; plus de mémoire
pt_br: erro arr_create memoria insufiente

source: Error in array count
fr_ca: Erreur dans le compte du tableau
pt_br: Erro ao contar array

source: Error in array
fr_ca: Erreur de tableau
pt_br: Erro no array

source: Warning: cannot create dataset, template not finalized
fr_ca: Attention : impossible de créer l'ensemble de données, le gabarit n'est pas finalisé
pt_br: Atenção: impossível criar conjunto de dados, modelo não concluído

source: Error: cannot create datasubset, template not defined in dataset
fr_ca: Attention : impossible de créer le sous-ensemble de données, le gabarit n'est pas défini dans l'ensemble de données
pt_br: Atenção: impossível criar subconjunto de dados, modelo não definido no conjunto de dados

source: ### Creating BUFR Message with Dataset
fr_ca: ### Creation du message BUFR avec l'ensemble de données
pt_br: ### Criando Mensagem BUFR com múltiplo Conjunto de Dados

source: ### Data not compressible
fr_ca: ### Données non compressibles
pt_br: ### Dados não comprimíveis

source: Storing Subset # %d
fr_ca: Enregistrement du sous-ensemble # %d
pt_br: Armazenando Subconjunto # %d

source: Storing %d compressed Subsets of %d items
fr_ca: Enregistrement de %d sous-ensembles compressés de %d éléments
pt_br: Armazenando %d Subconjunto comprimido de %d itens

source: Warning: BUFR message length is %lld octet.
fr_ca: Attention : la longueur du message BUFR est de %lld octet.
pt_br: Atenção: tamanho da mensagem BUFR é %lld octeto.

source: It exceeds the maximum allowed of %d octet
fr_ca: Ceci dépasse le maximum permis qui est de %d octet
pt_br: Ultrapassa o máximo permitido de %d octet

source: Error: internal problem in bufr_value2bits(), wrong type:%.6d (%d)
fr_ca: Erreur : Problème interne à la fonction « bufr_value2bits() », type erroné : %.6d (%d)
pt_br: Erro: problema interno em bufr_value2bits(), tipo errado:%.6d (%d)

source: #Code: %.6d (0 bits)
fr_ca: #Code : %.6d (0 bit)
pt_br: #Codigo: %.6d (0 bits)

source: Code: %.6d
pt_br: Codigo: %.6d

source: Warning: expecting string but is null: descriptor=%d
fr_ca: Attention : chaîne de caractères attendue au lieu de la valeur nulle : descripteur=%d
pt_br: Atenção: esperando string mas ele é nulo: descritor=%d

source: ### Converting BUFR Message into Dataset
fr_ca: ### Conversion du message BUFR à l'ensemble de données
pt_br: ### Convertendo mensagem BUFR em Dataset

source: Warning: master Table B version: %d less than message: %d
fr_ca: Attention : la version de la table B maître : %d est moindre que celle du message : %d
pt_br: Atenção: Versão da Tabela B Mestre: %d menor que na messagem: %d

source: Warning: master Table B version: %d differs from message's: %d
fr_ca: Attention : la version de la table B maître : %d est différente de celle du message : %d
pt_br: Atenção: Versão da Tabela B Mestre: %d difere da mensagem: %d

source: Error: a BUFR_Tables is required to decode BUFR Message into Dataset
fr_ca: Erreur : une table BUFR est requise pour pouvoir décoder le message BUFR vers l'ensemble de données
pt_br: Erro: uma Tabela_BUFR é necessária para decodificar Mensagem BUFR em Dataset

source: ### Message is not compressed
fr_ca: ### Le message n'est pas compressé
pt_br: ### Mensagem não está comprimida

source: ### Message is compressed
fr_ca: ### Le message est compressé
pt_br: ### Mensagem está comprimida

source: Warning: NBINC=%d is bigger than (%d bit)
fr_ca: Attention : NBINC=%d est plus grand que (%d bit)
pt_br: Atenção: NBINC=%d está maior do que (%d bit)

source: ### Dataset not compressible, delayed replication count differs
fr_ca: ### L'ensemble de données n'est pas compressible, le compte de la répétition différée n'est pas le même
pt_br: ### Conjunto de Dados não comprimível, divergência no contador para replicação tardia

source: Error: can't open Datafile %s
fr_ca: Erreur : impossible d'ouvrir le fichier de données %s
pt_br: Erro: não pode abrir Arquivo de Dados %s

source: Loading: %s
fr_ca: Chargement de : « %s »
pt_br: Carregando: %s

source: *** Input for: %d
fr_ca: *** Entrée pour : %d
pt_br: *** Entrada para: %d

source: Error: no more descriptors for data
fr_ca: Erreur : plus de descripteurs pour les données
pt_br: Erro: falta descritores para os dados

source: Error: data descriptor %d mismatch with template %d
fr_ca: Erreur : Le descripteur de données : %d ne correspond pas au gabarit : %d
pt_br: Erro: descritor de dados %d incompatível com modelo %d

source: *** skipping comment: '%s'
fr_ca: *** saut du commentaire : « %s »
pt_br: *** saltando comentário: '%s'

source: *** has AF: %s -> %llx
fr_ca: *** contient des champs associés(AF) : %s -> %llx
pt_br: *** tem AF: %s -> %llx

source: *** found value: '%s'
fr_ca: *** valeur trouvée : « %s »
pt_br: *** valor encontrado: '%s'

source: *** has value: '%s' -> '%s'
fr_ca: *** a la valeur : « %s » -> « %s »
pt_br: *** tem valor: '%s' -> '%s'

source: *** has value: %s -> %d
fr_ca: *** a la valeur : « %s » -> « %d »
pt_br: *** tem valor: %s -> %d

source: *** has value: %s -> %f
fr_ca: *** a la valeur : « %s » -> « %f »
pt_br: *** tem valor: %s -> %f

source: Warning: datafile bufr edition %d differs with template's %d
fr_ca: Attention : Le numéro d'édition du fichier de données BUFR : %d diffère de celui du gabarit : %d
pt_br: Atenção: edição do BUFR no arquivo de dados %d difere do modelo %d

source: Error: can't open input file %s
fr_ca: Erreur : impossible d'ouvrir le fichier d'entrée : %s
pt_br: Erro: impossível abrir arquivo de entrada %s

source: Error: can't open output file %s
fr_ca: Erreur : impossible d'ouvrir le fichier de sortie : %s
pt_br: Erro: impossível abrir arquivo de saída %s

source: Saving message with %d subset
fr_ca: Enregistrement du message avec %d sous-ensemble
pt_br: Gravando mensagem com %d subconjunto

source: Warning: unsupported Table C operator %d in BUFR version %d
fr_ca: Attention : opérateur de table C : %d non supporté dans la version : %d de BUFR
pt_br: Atenção: operador %d da Tabela C não suportado na versão %d do BUFR

source: Warning: Table C operator %d has not been implemented
fr_ca: Attention : l'opérateur de table C : %d n'a pas été implémenté
pt_br: Atenção: operador %d da Tabela C não foi implementado

source: Warning: unsupported IEEE floating point width=%d, ignored
pt_br: Atenção: ponto flutuante IEEE tamanho=%d não suportado, ignorado

source: Matching increment %.6d to %.6d incr=%f
pt_br: Igualando incremento .6d para %.6d incr=%f

source: Associating %d
pt_br: Associando %d

source: Error in bufr_dupl_descriptor(): cannot copy NULL in bufr_dupl_descriptor
fr_ca: Erreur avec la fonction : « bufr_dupl_descriptor() » : impossible de copier la valeur nulle
pt_br: Erro em bufr_dupl_descriptor(): não é possível copiar NULL em bufr_dupl_descriptor

source: Warning: cannot assign a value to descriptor %d
fr_ca: Attention : impossible d'assigner une valeur pour le descripteur : %d
pt_br: Atenção: Impossível atribuir um valor para descritor %d

source: Warning: The value %f of descriptor %d is out of range [%f,%f]
fr_ca: Attention : la valeur %f du descripteur %d est hors limites [%f,%f]
pt_br: Atenção: O valor %f do descritor %d está fora do intervalo [%f,%f]

source: Warning: The value %d of descriptor %d is out of range [%.0f,%.0f]
fr_ca: Attention : la valeur %d du descripteur %d est hors limites [%.0f,%.0f]
pt_br: Atenção: O valor %d do descritor %d está fora do intervalo [%.0f,%.0f]

source: Warning: cannot set value for descriptor:
fr_ca: Attention : impossible d'assigner une valeur pour le descripteur :
pt_br: Atenção: impossível definir valor para o descritor:

source: with value=%s
fr_ca: avec valeur=%s
pt_br: com valor=%s

source: ### Decoded double: %llx -> %E (sign=%d exponent=%llx signific=%llx)
pt_br: ### Decoficado duplo: %llx -> %E (sinal=%d exponente=%llx signific=%llx)

source: ### Decoded single: %x -> %E (sign=%d exponent=%x signific=%x)
pt_br: ### Decodificado simples: %x -> %E (sinal=%d exponente=%x signific=%x)

source: Warning: IEEE 754 encoding/decoding mismatch F32: %x -> %E -> %x
pt_br: Atenção: Codificação/decodificação IEEE 754 incompatível F32: %x -> %E -> %x

source: ### IEEE 754 encoding/decoding matched F32: %x -> %E -> %x
pt_br: ### Codificação/decodificação IEEE 754 encontrada F32: %x -> %E -> %x

source: Warning: IEEE 754 encoding/decoding mismatch F64: %llx -> %E -> %llx
pt_br: Atenção: Codificação/decodificação IEEE 754 incompatível F64: %llx -> %E -> %llx

source: ### IEEE 754 encoding/decoding matched F64: %llx -> %E -> %llx
pt_br: ### Codificação/decodificação IEEE 754 encontrada F64: %llx -> %E -> %llx

source: ### Checking: %s size is %d byte:
fr_ca: ### Vérification : la taille de « %s » est de %d octet:
pt_br: ### Verificando: %s tamanho é %d bytes:

source: Failed: size should be %d byte
fr_ca: Erreur : la taille devrait être de %d octet
pt_br: Falha: o tamanho deve ser %d bytes

source: Failed: sign bit is not 1 on negative float value
fr_ca: Erreur : le bit de signe ne vaut pas 1 avec une valeur négative en point flottant
pt_br: Falha: bit de sinal não é 1 em valor ponto flutuante negativo

source: Failed: sign bit is not 0 on positive float value
fr_ca: Erreur : le bit de signe ne vaut pas 0 avec une valeur positive en point flottant
pt_br: Falha: bit de sinal não é 0 em valor ponto flutuante positivo

source: Failed: sign bit is not 1 on double negative value
fr_ca: Erreur : le bit de signe ne vaut pas 1 avec une valeur négative en double point flottant
pt_br: Falha: bit de sinal não é 1 em valor precisão dupla negativo

source: Failed: sign bit is not 0 on double positive value
fr_ca: Erreur : le bit de signe ne vaut pas 0 avec une valeur positive en double point flottant
pt_br: Falha: bit de sinal não é 0 em valor precisão dupla positivo

source: ### Checking Memory Layout of float and double for IEEE 754 ...
fr_ca: ### Vérification de la norme IEEE 754 pour la disposition en mémoire des points flottants simple et double ...
pt_br: ### Verificando layout de memória em precisão ponto flutuante e dupla para IEEE 754 ...

source: ### Checked: good, C float and double use IEEE 754
fr_ca: ### Vérifié : les points flottants simple et double en C utilisent la norme IEEE 754
pt_br: ### Verificado: bom, C usa IEEE 754 em precisão ponto flutuante e dupla

source: ### Decoding double OK for value %E
fr_ca: ### Décodage du double point flottant validé pour la valeur : %E
pt_br: ### Decodificando precisão dupla OK para valor %E

source: Warning: decoding of double differ with value %E != %E
fr_ca: Attention : le décodage du double point flottant est différent : %E != %E
pt_br: Atenção: decodifcando de precisão dupla difere com valor %E != %E

source: ### Decoding float OK for value %E
fr_ca: ### Décodage du point flottant validé pour la valeur %E
pt_br: ### Decodificando ponto flutuante OK para valor %E

source: Warning: decoding of float differ with value %E != %E
fr_ca: Attention : le décodage du point flottant est différent : %E != %E
pt_br: Atenção: decoficando de ponto flutuante difere com valor %E != %E

source: ### Encoding float OK for value %E
fr_ca: ### Encodage du point flottant validé pour la valeur %E
pt_br: ### Codificação em ponto flutuante OK para valor %E

source: Warning: encoding of float differ with value %E != %E
fr_ca: Attention : l'encodage du point flottant est différent : %E != %E
pt_br: Atenção: Codificação em ponto flutuante difere do valor %E != %E

source: ### Encoding double OK for value %E
fr_ca: ### Encodage du double point flottant validé pour la valeur %E
pt_br: ### Codificação precisão dupla OK para valor %E

source: Warning: encoding of double differ with value %E != %E
fr_ca: Attention : l'encodage du double point flottant est différent : %E != %E
pt_br: Atenção: codificação em precisão dupla difere do valor %E != %E

source: ### Writing BUFR Message
fr_ca: ### Écriture du message BUFR
pt_br: ### Gravando Mensagem BUFR

source: Error: cannot create BUFR message with a length of %d octet
fr_ca: Erreur : impossible de créer le message BUFR avec une longueur de %d octet
pt_br: Erro: impossível criar mensagem BUFR com tamanho de %d octet

source: Warning: bufr_getbits( %d ), max_nbbits=64
fr_ca: Attention : bufr_getbits( %d ), max_nbbits=64
pt_br: Atenção: bufr_getbits(%d), max_nbbits=64

source: Warning: bufr_getbits( %d ), out of bounds!
fr_ca: Attention : bufr_getbits( %d ), hors limite !
pt_br: Atenção: bufr_getbits(%d), fora dos limites!

source: Warning: bufr_putbits() max_nbbits=64 < nbbits=%d
fr_ca: Attention : bufr_putbits() max_nbbits=64 < nbbits=%d
pt_br: Atenção: bufr_putbits() max_nbbits=64 < nbbits=%d

source: bitno=%d start=%x current=%x len=%d, at=%d, filled=%d max=%d
pt_br: bit=%d inicio=%x currente=%x tamanho=%d, em=%d, preenchido=%d max=%d

source: ### Reading BUFR edition: %d
fr_ca: ### Lecture de l'édition du BUFR : %d
pt_br: ### Lendo BUFR edição: %d

source: ### Message length: %d
fr_ca: ### Longueur du message : %d
pt_br: ### Tamanho da mensagem: %d

source: ### Section1 contains additionnal data length=%d octet
fr_ca: ### La section 1 contient des informations supplémentaires, longueur=%d octet
pt_br: ### Seção 1 contém dado adicional tamanho=%d octeto

source: Warning: length of Section 1 is %d, should have been %d
fr_ca: Attention : la longueur de la section 1 est de : %d, elle aurait dû être de : %d
pt_br: Atenção: tamanho da Seção 1 é %d, deveria ter sido %d

source: ### Section2 contains additionnal data length=%d octet
fr_ca: ### La section 2 contient des informations supplémentaires, longueur=%d octet
pt_br: ### Seção 2 contém dado adicional tamanho=%d octeto

source: Warning: BUFR message not ending with 7777
fr_ca: Attention : le message BUFR ne se termine pas par 7777
pt_br: Atenção: Mensagem BUFR não terminou com 7777

source: ### Decoding Section 3: contains %d item
fr_ca: ### Décodage de la section 3 : elle contient %d élément
pt_br: ### Decodificando Seção 3: contém %d item

source: ### Checking if local Table Update Message is needed
fr_ca: ### Vérification de la nécessité du message de mise à jour de la table locale
pt_br: ### Verificando se é necessário atualizar mensagem da Tabela local

source: ### no, Dataset is null
fr_ca: ### non, l'ensemble de données est nul
pt_br: ### não, Conjunto de dados está nulo

source: ### no, Dataset has no template
fr_ca: ### non, l'ensemble de données n'a pas de gabarit
pt_br: ### não, Conjunto de dados não tem modelo

source: ### no, Dataset has no local tables
fr_ca: ### non, l'ensemble de données n'a pas de tables locales
pt_br: ### não, Conjunto de dados não tem tabela local

source: ### no, Local tables are empty
fr_ca: ### non, les tables locales sont vides
pt_br: ### não, Tabelas locais estão vazian

source: ### Creating Local Table Update BUFR Message
fr_ca: ### Création du message BUFR concernant la mise à jour de la table locale
pt_br: ### Criando Mensagem BUFR de atualização da Tabela Local

source: Error expanding descriptor: %d
fr_ca: Erreur dans l'expansion du descripteur : %d
pt_br: Erro ao expandir descritor: %d

source: ### Local tables contain %d table B entry
fr_ca: ### Les tables locales contiennent %d entrée de table B
pt_br: ### Tabela local contém %d item na tabela B

source: ### Local tables contain %d table D entry
fr_ca: ### Les tables locales contiennent %d entrée de table D
pt_br: ### Tabela local contém %d item na tabela D

source: ### Extracting Local Table Update from BUFR Message
fr_ca: ### Extraction de la mise à jour de la table locale, à partir du message BUFR
pt_br: ### Extraindo atualização para Tabela local da Mensagem BUFR

source: Extracted TableB %d : (%d bit) %s
fr_ca: Table B %d, extraite : (%d bit) %s
pt_br: Extraído da TabelaB %d: (%d bit) %s

source: Warning: Table D descriptor %d is incomplete, got only %d of %d, rejected.
fr_ca: Attention : Le descripteur de table D : « %d » est incomplet, seulement %d de %d, rejetée.
pt_br: Atenção: Descritor da Tabela D %d está incompleto, obteve apenas %d de %d, rejeitado.

source: Extracted TableD %d : %d item
fr_ca: Table D %d extraite : %d élément
pt_br: Extraído da Tabela D %d item

source: Warning: bufr_print_message( NULL )
fr_ca: Attention : bufr_print_message( NULL )
pt_br: Atenção: bufr_print_message (NULL)

source: ### Message header : "%s"
fr_ca: ### Entête du message : « %s »
pt_br: ### Cabeçalho da Mensagem : "%s"

source: ### BUFR Edition : %d
fr_ca: ### Edition BUFR : %d
pt_br: ### Edição do BUFR : %d

source: ### length : %d
fr_ca: ### longueur : %d
pt_br: ### tamanho : %d

source: ### Section 0
pt_br: ### Seção 0

source: ### length : %d
fr_ca: ### longueur : %d
pt_br: ### tamanho : %d

source: ### Section 1
pt_br: ### Seção 1

source: ### BUFR master table : %d
fr_ca: ### Table BUFR maître : %d
pt_br: ### Tabela Mestre do BUFR: %d

source: ### originating center : %d
fr_ca: ### centre de provenance : %d
pt_br: ### centro de origem : %d

source: ### sub center : %d
fr_ca: ### sous-centre : %d
pt_br: ### sub centro : %d

source: ### update sequence number : %d
fr_ca: ### numéro de mise à jour du message : %d
pt_br: ### número de seqüência de atualização: %d

source: ### Data category : %d
fr_ca: ### Catégorie de données : %d
pt_br: ### Categoria dos Dados : %d

source: ### Data subcategory : %d
fr_ca: ### Sous-catégorie de données : %d
pt_br: ### Subcategoria dos Dados: %d

source: ### International sub category : %d
fr_ca: ### Sous-catégorie internationale : %d
pt_br: ### Subcategoria Internacional : %d

source: ### Local sub category : %d
fr_ca: ### Sous-catégorie locale : %d
pt_br: ### Subcategoria Local : %d

source: ### master table version : %d
fr_ca: ### version de la table maître : %d
pt_br: ### Versão da tabela master: %d

source: ### local table version : %d
fr_ca: ### version de la table locale : %d
pt_br: ### Versão da Tabela Local: %d

source: ### Year : %d
fr_ca: ### Année : %d
pt_br: ### Ano : %d

source: ### Month : %d
fr_ca: ### Mois : %d
pt_br: ### Mês : %d

source: ### Day : %d
fr_ca: ### Jour : %d
pt_br: ### Dia : %d

source: ### Hour : %d
fr_ca: ### Heure : %d
pt_br: ### Hora : %d

source: ### Min : %d
pt_br: ### Minuto : %d

source: ### Sec : %d
pt_br: ### Segundo : %d

source: ### octet 8 : %d
pt_br: ### octeto 8 : %d

source: ### optional section :
fr_ca: ### section optionelle :
pt_br: ### Seção opcional :

source: Yes
fr_ca: Oui
pt_br: Sim

source: No
fr_ca: Non
pt_br: Não

source: ### Section 2
pt_br: ### Seção 2

source: ### Section 3
pt_br: ### Seção 3

source: ### datasubsets : %d
fr_ca: ### sous-ensembles de données : %d
pt_br: ### subconjunto de dados : %d

source: ### octet 7 : %d
pt_br: ### octeto 7 : %d

source: ### compression :
pt_br: ### compressão :

source: ### observed data
fr_ca: ### données observées
pt_br: ### dados observados

source: ### other data
fr_ca: ### autre données
pt_br: ### outros dados

source: ### Section 4
pt_br: ### Seção 4

source: Warning: unsupported BUFR edition=%d, default=4
fr_ca: Attention : édition BUFR non supportée : %d, défaut=4
pt_br: Atenção: Edição do BUFR não suportado=%d, default=4

source: Error in bufr_add_descriptor_to_sequence(): list is NULL
fr_ca: Erreur avec la fonction « bufr_add_descriptor_to_sequence() » : la liste est nulle
pt_br: Erro em bufr_add_descriptor_to_sequence(): lista é NULL

source: Error: cannot expand template sequence
fr_ca: Erreur : impossible de faire l'expansion de la séquence du gabarit
pt_br: Erro: impossível expandir a sequencia do template

source: Error: unknown descriptor in bufr_expand_desc %d
fr_ca: Erreur : la fonction « bufr_expand_desc » fait face à un descripteur inconnu : %d
pt_br: Erro: descritor desconhecido em bufr_expand_desc %d

source: Error: delayed replication not followed by class 31 code=%d
fr_ca: Erreur : la répétition différée n'est pas suivie par la classe 31, code=%d
pt_br: Erro: replicador de retardo não acompanhado pela classe de código 31=%d

source: Error in bufr_repl_descriptors(): node is null
fr_ca: Erreur avec la fonction « bufr_repl_descriptors() » : le noeud est nul
pt_br: Erro em bufr_repl_descriptors(): nó é nulo

source: ERROR, can't replicate codes: %d %d while duplicating: %d
fr_ca: ERREUR, impossible de répéter les codes : %d et %d durant la duplication de : %d
pt_br: ERRO, impossível replicar códigos: %d %d ao duplicar: %d

source: ### Checking template codes list
fr_ca: ### Vérification de la liste des codes du gabarit
pt_br: ### Verificando lista de códigos no template

source: Error in bufr_check_sequence(): unsupported BUFR edition %d
fr_ca: Erreur avec la fonction « bufr_check_sequence() » : édition BUFR %d non supportée
pt_br: Erro em bufr_check_sequence(): edição do BUFR não suportada %d

source: Warning: %d is followed by %d (not a local descriptor)
fr_ca: Attention : %d est suivi de %d (ceci n'est pas un descripteur local)
pt_br: Atenção: %d é seguido por %d (não é um descritor local)

source: Error: expecting Class 31021 after 204YYY but found: %d
fr_ca: Erreur : la classe 31021 est attendue après 204YYY, mais : %d a été trouvé
pt_br: Erro: esperando Classe 31021 depois de 204YYY mas encontrada: %d

source: Error: expecting Class 31 after delayed replication but found: %d
fr_ca: Erreur : la classe 31 est attendue après la répétition différée, mais %d a été trouvé
pt_br: Erro: esperando Classe 31 depois de replicador tardio mas encontrada: %d

source: Error: bad replication code count in dataset definition
fr_ca: Erreur : compte erroné de code de répétition dans la définition de l'ensemble de données
pt_br: Erro: código replicador equivocado na definição do conjunto de dados

source: Warning: expecting local descriptor after 206YYY but found: %d
fr_ca: Attention : un descripteur local est attendu après 206YYY, mais %d a été trouvé
pt_br: Atenção: esperando descritor local depois de 206YYY mas encontrado: %d
