Repository: ECCC-MSC/libecbufr
Catalog: po/*.po
Languages: fr_ca, pt_br

source: ### Checking #Code Replication >> %.6d : {
pt_br: ### Verificando #Código Replicador >> %.6d : {

source: Error obtaining Repl Rank of %d = %d
pt_br: Erro ao obter Faixa do Replicador de of %d = %d

source: Warning: bitmap size %d != %d data present descriptors
pt_br: Atenção: tamanho do bitmap %d != %d dados descritores presente

source: Warning: local descriptor %.6d (%d bit) doesn't match %d, should have been %d
fr_ca: Attention : le descripteur local %.6d (%d bit) ne corresponds pas à %d, il aurait dû être %d
pt_br: Atenção: descritor local %.6d (%d bit) não corresponde %d, deveria ter sido %d

source: ### Setting local descriptor %.6d to %d bit
fr_ca: ### Attribution de %2$d bit au descripteur local %1$.6d
pt_br: ### Definido descritor local %.6d para %d bit

source: ### 201 %d datawidth=%d
pt_br: ### 201 %d dados largura=%d

source: ### 202 %d scale=%d
pt_br: ### 202 %d escale=%d

source: ### 203 %d reference=%d
pt_br: ### 203 %d referencia=%d

source: ### Changing REF: %d to %d bit:
fr_ca: ### REF : %d a désormais %d bit :
pt_br: ### Mudando REF: %d para %d bit:

source: codetable overrided
pt_br: tabela de código sobrescrita

source: codetable entry not found
pt_br: entrada não encontrada na tabela de código

source: No value
fr_ca: Aucune valeur
pt_br: Sem valor

source: Error: invalid delayed replication count code : %.6d
fr_ca: Erreur : code de compte de répétition différée erroné : %.6d
pt_br: Erro: contagem do código replicador tardio inválida: %.6d

source: ### Code Count: %d
fr_ca: ### Compte de code : %d
pt_br: ### Código contagem: %d

source: ### Indexed DPBM Data Descriptor count: %d
pt_br: ### Contagem do Descritor de dados indexedos DPBM: %d

source: Warning: Table D descriptor : %d is in a circular loop
fr_ca: Attention : Le descripteur de la table D : %d est dans une boucle circulaire
pt_br: Atenção: Descritor da Tabela D: %d está em um loop circular

source: Warning: invalid Table D descriptor : %d
fr_ca: Attention : descripteur de table D invalide : %d
pt_br: Atenção: Descritor da Table D inválido: %d

source: Warning: Unknown BUFR descriptor: %d
fr_ca: Attention : descripteur BUFR inconnu : %d
pt_br: Atenção: descritor BUFR desconhecido: %d

source: Warning: Table D Code unknown: %d
fr_ca: Attention : Code de table D inconnu : %d
pt_br: Atenção: Código da Tabela D desconhecido: %d

source: Warning: Table D sequence not found
fr_ca: Attention : la séquence de table D n'a pas été trouvée
pt_br: Atenção: sequencia da Tabela D não encontrada

source: Warning: can't open Table B file %s
fr_ca: Attention : impossible d'ouvrir le fichier de table B : %s
pt_br: Atenção: impossível abrir arquivo da Tabela B %s

source: Skipped invalid descriptor: %s
fr_ca: Descripteur invalide ignoré : %s
pt_br: Pulando descritor inválido: %s

source: Skipped local descriptor: %s
fr_ca: Descripteur local ignoré : %s
pt_br: Pulando descritor local: %s

source: Warning: error while loading Table B file: %s
fr_ca: Attention : erreur lors du chargement du fichier de table B : %s
pt_br: Atenção: erro ao carregar arquivo da Tabela B: %s

source: Error reading descriptor: %d unit="%s"
fr_ca: Erreur lors de la lecture du descripteur : %d unit="%s"
pt_br: Erro lendo descritor: %d unidade="%s"

source: Loaded descriptor: %s
fr_ca: Descripteur chargé : %s
pt_br: Descritor carregado: %s

source: Warning: can't open Table D file %s
fr_ca: Attention : impossible d'ouvrir le fichier de table D : %s
pt_br: Atenção: impossível abrir arquivo da Tabela D %s

source: Warning: UNDERFLOW with element %d : value = %e, giving %lld
fr_ca: Attention : SOUPASSEMENT DE CAPACITÉ avec l'élément %d : valeur = %e, donnant %lld
pt_br: Atenção: UNDERFLOW com elemento %d : valor = %e, resultando %lld

source: Warning: OVERFLOW with element %d (max=%lld) : value = %e, giving %lld
fr_ca: Attention : DÉPASSEMENT DE CAPACITÉ avec l'élément %d (maximum = %lld) : valeur = %e, donnant %lld
pt_br: Atenção: OVERFLOW com elemento %d (max=%lld) : valor = %e, resultando %lld

source: Warning: UNDERFLOW with element %d : value = %f, giving %lld
fr_ca: Attention : SOUPASSEMENT DE CAPACITÉ avec l'élément %d : valeur = %f, donnant %lld
pt_br: Atenção: UNDERFLOW com elemento %d : valor = %f, resultando %lld

source: TableD : %d
pt_br: abelaD : %d

source: Error: not a valid descriptor %d
fr_ca: Erreur : Ceci n'est pas un descripteur valide : %d
pt_br: Erro: descritor inválido %d

source: Descriptor %d has sig data width %d
pt_br: Descritor %d tem o tamanho do dado de sinal %d

source: Descriptor %d ??
fr_ca: Descripteur %d ??
pt_br: Descritor %d ??

source: Error: unknown descriptor %d
fr_ca: Erreur : descripteur inconnu : %d
pt_br: Erro: descritor desconhecido %d

source: Error: Template definition contains error(s)
fr_ca: Erreur : La définition du gabarit contient des erreurs
pt_br: Erro: Definição do Template contém erro(s)

source: Error: Unable to create Template
fr_ca: Erreur : impossible de créer le gabarit
pt_br: Erro: Impossível criar Template

source: Error: template contains errors
fr_ca: Erreur : le gabarit contient des erreurs
pt_br: Erro: template contém erros

source: ### Loading template file "%s"
fr_ca: ### Chargement du fichier gabarit « %s »
pt_br: ### Carregado arquivo template "%s"

source: Error: can't open template file %s
fr_ca: Erreur : impossible d'ouvrir le fichier gabarit « %s »
pt_br: Erro: impossível abrir arquivo template %s

source: ### template has a local table B: %s
fr_ca: ### le gabarit a une table B locale : %s
pt_br: ### template tem uma tabela B local: %s

source: ### template has a master table B: %s
fr_ca: ### le gabarit a une table B maître : %s
pt_br: ### template tem uma table B master: %s

source: ### template has a local table D: %s
fr_ca: ### le gabarit a une table D locale : %s
pt_br: ### template tem uma tabela D local: %s

source: ### template has a master table D: %s
fr_ca: ### le gabarit a une table D maître : %s
pt_br: ### template tem uma tabela D master: %s

source: ### template BUFR Version: %d
fr_ca: ### version BUFR du gabarit : %d
pt_br: ### Versão do template do BUFR: %d

source: Error: require a master BUFR Tables
fr_ca: Erreur : des tables BUFR maîtres sont requises
pt_br: Erro: requer uma Tabela master para o BUFR

source: Error: can't load template file %s
fr_ca: Erreur : impossible de charger le fichier gabarit « %s »
pt_br: Erro: impossível carregar arquivo template %s

source: Error: Template file %s contains error(s)
fr_ca: Erreur : Le fichier gabarit « %s » contient des erreurs
pt_br: Erro: Arquivo Template %s contém erro(s)

source: ### Finished loading template file
fr_ca: ### Chargement du fichier gabarit terminé
pt_br: ### Carregamento do arquivo template finalizado

source: ### Template contains %d descriptor
fr_ca: ### Le gabarit contient %d descripteur
pt_br: ### Template contém %d descrito

source: Error: cannot copy NULL in bufr_duplicate_value
fr_ca: Erreur : impossible de copier la valeur nulle dans la fonction « bufr_duplicate_value »
pt_br: Erro: impossível copiar NULL em bufr_duplicate_value

source: Warning: %lld needs at least %d bit for storage
fr_ca: Attention : %lld nécessite au moins %d bit pour l'enregistrement
pt_br: Atenção: %lld precisa no mínimo %d bit para armazenamento

source: (0 bits)
fr_ca: (0 bit)
