Repository: ECCC-MSC/libecbufr
Catalog: Utilities/po/*.po
Languages: fr_ca

source: BUFR Decoder Version %s
fr_ca: Décodeur BUFR version %s

source: Copyright Her Majesty The Queen in Right of Canada, Environment Canada, 2009
fr_ca: Copyright Sa Majesté la Reine du Chef du Canada, Environnement Canada, 2009

source: [-inbufr <filename>] BUFR file to decode
fr_ca: [-inbufr <fichier>] fichier BUFR à décoder

source: [-ltableb <filename>] local table B to use for decoding
fr_ca: [-ltableb <fichier>] table B locale à utiliser pour le décodage

source: [-ltabled <filename>] local table D to use for decoding
fr_ca: [-ltabled <fichier>] table D locale à utiliser pour le décodage

source: [-output <filename>] output file
fr_ca: [-output <fichier>] fichier de sortie

source: [-otemplate <filename>] output template into file
fr_ca: [-otemplate <fichier>] fichier gabarit de sortie

source: [-debug] debug mode (put the messages into file)
fr_ca: [-debug] mode de débogage (place les messages dans le fichier)

source: [-nometa] dont show meta info
fr_ca: [-nometa] sans méta information

source: [-dump] dump template and data in ASCII file suitable for re-encoding
fr_ca: [-dump] écrire le gabarit et les données en format ASCII dans un fichier prêt pour le ré-encodage

source: [-describe] show description and unit
fr_ca: [-describe] afficher la description et les unités

source: [-location] show implicit location or time
fr_ca: [-location] afficher la position ou le temps implicite

source: [-locdesc <descriptor>] show RTMD of the location descriptors
fr_ca: [-locdesc <descripteur>] afficher le RTMD des descripteurs de position

source: [-no_format] disable formatting
fr_ca: [-no_format] sans formattage

source: [-verbose] send more messages
fr_ca: [-verbose] afficher plus de messages

source: [-local] save the local table B
fr_ca: [-local] enregistrer la table B locale

source: [-stop <nb_messages>] stops decoding after the specified number of messages
fr_ca: [-stop <nb_messages>] arrêter l'enregistrement après le nombre de messages spécifié

source: Warning: No input file
fr_ca: Attention : Aucun fichier en entrée

source: * BUFR decoder : API version %s
fr_ca: Décodeur BUFR : la version de l'API est %s

source: Error: can't open file "%s"
fr_ca: Erreur : impossible d'ouvrir le fichier « %s »

source: Error: no BUFR tables version %d
fr_ca: Erreur: pas de table BUFR de la version %d

source: Decoding message version %d with BUFR tables version %d
fr_ca: Décoder un message version %d avec une table BUFR version %d

source: Error: can't decode messages
fr_ca: Erreur : impossible de décoder les messages

source: ## Subset %d : %d descriptor
fr_ca: ## Sous-ensemble %d : %d descripteur

source: MSNG
fr_ca: MANQUANTE

source: VALUE=%d
fr_ca: VALEUR=%d

source: VALUE=%lld
fr_ca: VALEUR=%lld

source: VALUE=
fr_ca: VALEUR=

source: VALUE=%s
fr_ca: VALEUR=%s

source: VALUE=MSNG
fr_ca: VALEUR=MANQUANTE

source: Error: descriptor not found in table B {%d}
fr_ca: Erreur : le descripteur n'a pu être trouvé dans la table B {%d}

source: BUFR Encoder Version %s
fr_ca: Encodeur BUFR version %s

source: [-outbufr <filename>] encoded BUFR file (default=OUT.bufr)
fr_ca: [-outbufr <fichier>] fichier BUFR (defaut=OUT.bufr)

source: [-datafile <filename>] data file from the dumped output of the decoder
fr_ca: [-datafile <fichier>] fichier de données obtenu à partir de l'option « -dump » du décodeur

source: [-template <filename>] template file to use for encoding
fr_ca: [-template <fichier>] gabarit à utiliser pour l'encodage

source: [-ltableb <filename>] local table B to use for encoding
fr_ca: [-ltableb <fichier>] table B locale à utiliser pour l'encodage

source: [-ltabled <filename>] local table D to use for encoding
fr_ca: [-ltabled <fichier>] table D locale à utiliser pour l'encodage

source: [-edition <number>] forcing the use of edition number (no template)
fr_ca: [-edition <nombre>] forcer l'utilisation d'une édition particulière (sans gabarit)

source: [-nbsubset <number>] specify the number of subset(s) of bogus data to generate
fr_ca: [-nbsubset <nombre>] spécifier le nombre de sous-ensemble(s) de données aléatoires à générer

source: [-def_values] use random default values
fr_ca: [-def_values] utiliser des valeurs par défaut au hasard

source: [-verbose] send more messages
fr_ca: [-verbose] affichier plus de messages

source: [-nolocal] do not save local tables to file (default=save)
fr_ca: [-nolocal] Ne pas enregistrer les tables locales dans des fichiers. (defaut=enregistrer)

source: [-compress] compress datasubsets if possible
fr_ca: [-compress] compresser les sous-ensembles de données si possible

source: [-no_compress] do not compress datasubsets
fr_ca: [-no_compress] sans compression des sous-ensembles de données

source: [-debug] debug mode (put the messages into file)
fr_ca: [-debug] mode de débogage (placer les messages dans le fichier)

source: [-sequence <descriptor>] sequence descriptor from table D
fr_ca: [-sequence <descripteur>] descripteur de séquence de la table D

source: Env. Variables:
fr_ca: Variables d'environnement :

source: BUFR_TEMPLATE : specify template file
fr_ca: BUFR_TEMPLATE : specifiez le fichier gabarit

source: BUFR_TABLES : path to BUFR tables in the CMC table format
fr_ca: BUFR_TABLES : chemin d'accès aux tables BUFR dans le format du CMC

source: * BUFR encoder : API version %s
fr_ca: * encodeur BUFR : la version de l'API est %s

source: Template not defined properly
fr_ca: Le gabarit n'est pas défini correctement

source: Error: unable to create dataset, abort
fr_ca: Erreur : incapable de créer l'ensemble de données, avortement du programme

source: Subset #%d : %d descriptor
fr_ca: Sous-ensemble #%d : %d descripteur
